{"backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 105, 105, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [], "config": {"batch_input_shape": [null, 105, 105, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "name": "input_2"}, {"inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "config": {"layers": [{"config": {"filters": 64, "kernel_initializer": "initialize_weights", "kernel_size": [10, 10], "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "padding": "valid", "batch_input_shape": [null, 105, 105, 1], "strides": [1, 1], "use_bias": true, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "kernel_initializer": "initialize_weights", "kernel_size": [7, 7], "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "padding": "valid", "strides": [1, 1], "activation": "relu", "bias_initializer": "initialize_bias"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 128, "kernel_initializer": "initialize_weights", "kernel_size": [4, 4], "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "padding": "valid", "strides": [1, 1], "activation": "relu", "bias_initializer": "initialize_bias"}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 256, "kernel_initializer": "initialize_weights", "kernel_size": [4, 4], "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "name": "conv2d_4", "padding": "valid", "strides": [1, 1], "activation": "relu", "bias_initializer": "initialize_bias"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": "initialize_bias", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "name": "dense_1", "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "units": 4096, "activation": "sigmoid", "kernel_initializer": "initialize_weights"}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "name": "sequential_1"}, {"inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}]]], "config": {"output_shape_type": "raw", "arguments": {}, "output_shape": null, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxkAAAB0AABqAQB8AABkAQAZfAAAZAIAGRiDAQBTKQNO6QAA\nAADpAQAAACkC2gFL2gNhYnMpAdoHdGVuc29yc6kAcgYAAAD6HzxpcHl0aG9uLWlucHV0LTExLTk1\nY2IzZjk2YTE1NT7aCDxsYW1iZGE+HgAAAHMAAAAA\n", null, null], "function_type": "lambda", "trainable": true, "name": "lambda_1"}, "class_name": "Lambda", "name": "lambda_1"}, {"inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"bias_initializer": "initialize_bias", "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "units": 1, "bias_regularizer": null, "name": "dense_2", "activation": "sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_2"}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1"}, "class_name": "Model", "keras_version": "2.2.4"}