{"config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "layers": [{"config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2", "class_name": "InputLayer"}, {"config": {"name": "sequential_1", "layers": [{"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [10, 10], "batch_input_shape": [null, 105, 105, 1], "activation": "relu", "trainable": true, "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": "initialize_weights", "dtype": "float32", "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [7, 7], "activation": "relu", "trainable": true, "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "filters": 128, "bias_initializer": "initialize_bias", "kernel_initializer": "initialize_weights", "strides": [1, 1], "use_bias": true, "name": "conv2d_2", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [4, 4], "activation": "relu", "trainable": true, "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "filters": 128, "bias_initializer": "initialize_bias", "kernel_initializer": "initialize_weights", "strides": [1, 1], "use_bias": true, "name": "conv2d_3", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [4, 4], "activation": "relu", "trainable": true, "kernel_regularizer": {"config": {"l2": 0.00019999999494757503, "l1": 0.0}, "class_name": "L1L2"}, "bias_regularizer": null, "filters": 256, "bias_initializer": "initialize_bias", "kernel_initializer": "initialize_weights", "strides": [1, 1], "use_bias": true, "name": "conv2d_4", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 4096, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": {"config": {"l2": 0.0010000000474974513, "l1": 0.0}, "class_name": "L1L2"}, "bias_constraint": null, "kernel_initializer": "initialize_weights", "bias_regularizer": null, "use_bias": true, "name": "dense_1", "bias_initializer": "initialize_bias"}, "class_name": "Dense"}]}, "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "name": "sequential_1", "class_name": "Sequential"}, {"config": {"output_shape": null, "function_type": "lambda", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxkAAAB0AABqAQB8AABkAQAZfAAAZAIAGRiDAQBTKQNO6QAA\nAADpAQAAACkC2gFL2gNhYnMpAdoHdGVuc29yc6kAcgYAAAD6HzxpcHl0aG9uLWlucHV0LTExLTk1\nY2IzZjk2YTE1NT7aCDxsYW1iZGE+HgAAAHMAAAAA\n", null, null], "arguments": {}, "output_shape_type": "raw", "trainable": true, "name": "lambda_1"}, "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"units": 1, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "bias_initializer": "initialize_bias"}, "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense"}]}, "keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Model"}