{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "name": "input_1", "sparse": false}}, {"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 105, 105, 1], "name": "input_2", "sparse": false}}, {"class_name": "Sequential", "name": "sequential_1", "inbound_nodes": [[["input_1", 0, 0, {}]], [["input_2", 0, 0, {}]]], "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "filters": 64, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.00019999999494757503}}, "data_format": "channels_last", "batch_input_shape": [null, 105, 105, 1], "activation": "relu", "use_bias": true, "trainable": true, "name": "conv2d_1", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [10, 10], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": "initialize_weights", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "filters": 128, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.00019999999494757503}}, "data_format": "channels_last", "activation": "relu", "use_bias": true, "trainable": true, "name": "conv2d_2", "bias_initializer": "initialize_bias", "kernel_constraint": null, "kernel_size": [7, 7], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": "initialize_weights", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "filters": 128, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.00019999999494757503}}, "data_format": "channels_last", "activation": "relu", "use_bias": true, "trainable": true, "name": "conv2d_3", "bias_initializer": "initialize_bias", "kernel_constraint": null, "kernel_size": [4, 4], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": "initialize_weights", "dilation_rate": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "padding": "valid", "filters": 256, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.00019999999494757503}}, "data_format": "channels_last", "activation": "relu", "use_bias": true, "trainable": true, "name": "conv2d_4", "bias_initializer": "initialize_bias", "kernel_constraint": null, "kernel_size": [4, 4], "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": "initialize_weights", "dilation_rate": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "kernel_initializer": "initialize_weights", "activation": "sigmoid", "trainable": true, "name": "dense_1", "units": 4096, "bias_initializer": "initialize_bias", "activity_regularizer": null, "bias_regularizer": null}}]}}, {"class_name": "Lambda", "name": "lambda_1", "inbound_nodes": [[["sequential_1", 1, 0, {}], ["sequential_1", 2, 0, {}]]], "config": {"output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "trainable": true, "function_type": "lambda", "output_shape": null, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxkAAAB0AABqAQB8AABkAQAZfAAAZAIAGRiDAQBTKQNO6QAA\nAADpAQAAACkC2gFL2gNhYnMpAdoHdGVuc29yc6kAcgYAAAD6HjxpcHl0aG9uLWlucHV0LTgtOTVj\nYjNmOTZhMTU1PtoIPGxhbWJkYT4eAAAAcwAAAAA=\n", null, null]}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["lambda_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "sigmoid", "kernel_regularizer": null, "name": "dense_2", "units": 1, "bias_initializer": "initialize_bias", "bias_regularizer": null, "activity_regularizer": null}}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}